ws-asahi/WazamonoCore/megaavr/variants/32pin-duseries/pins_arduino.h
  /* Use this for accessing PINnCTRL register */
  const uint8_t digital_pin_to_bit_position[] = { // *INDENT-OFF*
    #if ((CLOCK_SOURCE & 0x03) == 0) // PA0 used for external clock and crystal.
      PIN0_bp,//   0 PA0
    #else
      NOT_A_PIN,
    #endif
    #if ((CLOCK_SOURCE & 0x03) == 1)   // PA1 also used for crystal
      NOT_A_PIN,
    #else // PA1 used for external crystal.
      PIN1_bp,//   1 PA1
    #endif    // *INDENT-ON*
    PIN2_bp,   //  2 PA2/SDA
    PIN3_bp,   //  3 PA3/SCL
    PIN4_bp,   //  4 PA4/MOSI
    PIN5_bp,   //  5 PA5/MISO
    PIN6_bp,   //  6 PA6/SCK
    PIN7_bp,   //  7 PA7/SS/CLKOUT/LED_BUILTIN
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    PIN3_bp,   // 11 PC3
    PIN0_bp,   // 12 PD0/AIN0
    PIN1_bp,   // 13 PD1/AIN1
    PIN2_bp,   // 14 PD2/AIN2
    PIN3_bp,   // 15 PD3/AIN3
    PIN4_bp,   // 16 PD4/AIN4
    PIN5_bp,   // 17 PD5/AIN5
    PIN6_bp,   // 18 PD6/AIN6
    PIN7_bp,   // 19 PD7/AIN7/AREF
    PIN0_bp,   // 20 PF0/USART2_Tx/TOSC1
    PIN1_bp,   // 21 PF1/USART2_Rx/TOSC2
    PIN2_bp,   // 22 PF2
    PIN3_bp,   // 23 PF3
    PIN4_bp,   // 24 PF4
    PIN5_bp,   // 25 PF5
    PIN6_bp,   // 26 PF6 RESET
    PIN7_bp    // 27 PF7 UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = { // *INDENT-OFF*
    #if ((CLOCK_SOURCE & 0x03) == 0) // PA0 used for external clock and crystal.
      PIN0_bm,//   0 PA0
    #else
      NOT_A_PIN,
    #endif
    #if ((CLOCK_SOURCE & 0x03) == 1)   // PA1 also used for crystal
      NOT_A_PIN,
    #else // PA1 used for external crystal.
      PIN1_bm,//   1 PA1
    #endif    // *INDENT-ON*
    PIN2_bm,   //  2 PA2/SDA
    PIN3_bm,   //  3 PA3/SCL
    PIN4_bm,   //  4 PA4/MOSI
    PIN5_bm,   //  5 PA5/MISO
    PIN6_bm,   //  6 PA6/SCK
    PIN7_bm,   //  7 PA7/SS/CLKOUT/LED_BUILTIN
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    PIN3_bm,   // 11 PC3
    PIN0_bm,   // 12 PD0/AIN0
    PIN1_bm,   // 13 PD1/AIN1
    PIN2_bm,   // 14 PD2/AIN2
    PIN3_bm,   // 15 PD3/AIN3
    PIN4_bm,   // 16 PD4/AIN4
    PIN5_bm,   // 17 PD5/AIN5
    PIN6_bm,   // 18 PD6/AIN6
    PIN7_bm,   // 19 PD7/AIN7/AREF
    PIN0_bm,   // 20 PF0/TOSC1
    PIN1_bm,   // 21 PF1/TOSC2
    PIN2_bm,   // 22 PF2
    PIN3_bm,   // 23 PF3
    PIN4_bm,   // 24 PF4
    PIN5_bm,   // 25 PF5
    PIN6_bm,   // 26 PF6 RESET
    PIN7_bm    // 27 PF7 UPDI
  };


  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA0 TCA0 WO0 h/w default (not our default)
    NOT_ON_TIMER, //  1 PA1 TCA0 WO1 h/w default (not our default)
    TIMERB0,      //  2 PA2 TCA0 WO2 h/w default (not our default)
    TIMERB1,      //  3 PA3 TCA0 WO3 h/w default (not our default)
    NOT_ON_TIMER, //  4 PA4 TCA0 WO4 h/w default (not our default)
    NOT_ON_TIMER, //  5 PA5 TCA0 WO5 h/w default (not our default)
    NOT_ON_TIMER, //  6 PA6
    NOT_ON_TIMER, //  7 PA7
    NOT_ON_TIMER, //  8  USB
    NOT_ON_TIMER, //  9  USB
    NOT_ON_TIMER, // 10  USB
    NOT_ON_TIMER, // 11 PC3 TCA0 ALT2
    NOT_ON_TIMER, // 12 PD0 TCA0 ALT3
    NOT_ON_TIMER, // 13 PD1 TCA0 ALT3
    NOT_ON_TIMER, // 14 PD2 TCA0 ALT3
    NOT_ON_TIMER, // 15 PD3 TCA0 ALT3
    NOT_ON_TIMER, // 16 PD4 TCA0 ALT3
    NOT_ON_TIMER, // 17 PD5 TCA0 ALT3
    NOT_ON_TIMER, // 18 PD6 DAC0 output
    NOT_ON_TIMER, // 19 PD7
    NOT_ON_TIMER, // 20 PF0 TCA0 WO0 ALT5 (default)
    NOT_ON_TIMER, // 21 PF1 TCA0 WO1 ALT5 (default)
    NOT_ON_TIMER, // 22 PF2 TCA0 WO2 ALT5 (default)
    NOT_ON_TIMER, // 23 PF3 TCA0 WO3 ALT5 (default)
    NOT_ON_TIMER, // 24 PF4 TCA0 WO4 ALT5 (default)
    NOT_ON_TIMER, // 25 PF5 TCA0 WO5 ALT5 (default)
    NOT_ON_TIMER, // 26 PF6 RESET
    NOT_ON_TIMER  // 27 PF7 UPDI
  };

#endif

/* =================================================================
 *  USB identity   (AVR DU = USB-native part)
 * =================================================================
 *  Every AVR DU has the USB0 peripheral, so - like the ATmega32U4 on
 *  the Leonardo/Micro - the DU is treated as a USB-native board.  USBCON
 *  tells Arduino's HID / Keyboard / Mouse / Joystick libraries this board
 *  has USB.  USB_VID / USB_PID are the board identity and may be overridden
 *  from boards.txt (all #ifndef) - e.g. a ProMicro clone, or the USB-CDC
 *  bootloader board (0xDA33).  Defaults: pid.codes test VID/PID 0x1209:0xDA32.
 */
#ifndef USBCON
  #define USBCON
#endif
#ifndef USB_VID
  #define USB_VID                0x1209
#endif
#ifndef USB_PID
  #define USB_PID                0x0002
#endif
#ifndef USB_MANUFACTURER
  #define USB_MANUFACTURER       "DxCore"
#endif
#ifndef USB_PRODUCT
  #define USB_PRODUCT            "AVRDU"
#endif

/* =================================================================
 *  Serial  ->  native USB CDC      (Arduino Leonardo convention)
 * =================================================================
 *  DxCore's cores/dxcore/Arduino.h later does:
 *      #ifndef Serial
 *        #define Serial Serial0
 *      #endif
 *  Pre-defining Serial here points it at the on-chip USB CDC instance,
 *  USBSerial (class USBSerial_, declared in core USBSerial.h, guarded by
 *  USB0) - exactly as the ATmega32U4 cores make Serial the native USB port
 *  on the Leonardo/Micro.  USART0 stays reachable as Serial0 and USART1 as
 *  Serial1 on every DU board, so the hardware UART port names never shift
 *  between one DU board and another.
 *
 *  Whether the USB CDC is actually started at boot is decided by the core
 *  (usb_auto_init()), not here: the USB-CDC bootloader board auto-starts it
 *  (upload port + 1200bps touch), while a plain no-bootloader board leaves
 *  it inactive until the sketch calls Serial.begin() - so on such a board
 *  Serial simply produces no output unless USB is opened.
 *
 *  Define HAVE_NO_USB_SERIAL_REDIRECT (e.g. from boards.txt) to keep the
 *  legacy  Serial == USART0  behaviour instead.
 */
#if defined(USB0) && !defined(HAVE_NO_USB_SERIAL_REDIRECT)
  #ifndef Serial
    #define Serial                  USBSerial   /* Serial = native USB CDC   */
  #endif
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR     Serial      /* Serial Monitor -> USB     */
  #endif
  #ifndef SERIAL_PORT_USBVIRTUAL
    #define SERIAL_PORT_USBVIRTUAL  Serial      /* native USB virtual serial */
  #endif
#endif

#endif
